# Используем официальный образ Golang как базовый
FROM golang:1.20 AS builder

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем go.mod и go.sum и устанавливаем зависимости
COPY go.mod go.sum ./
RUN go mod tidy

# Копируем исходный код приложения
COPY . .

# Сборка приложения
RUN go build -o app .

# Используем легкий образ для запуска
FROM golang:1.20-alpine

# Копируем скомпилированное приложение из предыдущего этапа
COPY --from=builder /app/app /app

# Открываем порт (если необходимо для вашего приложения)
EXPOSE 8080

# Команда по умолчанию для запуска приложения
CMD ["/app"]
